Конфигурация/InformationRegisters/НомераВерсийОтчетовДляКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НомераВерсийОтчетовДляКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Экземпляр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭкземплярыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/НомераВерсийОтчетовДляКлиентов/Ext/ManagerModule.bsl
// Возвращает, а при необходимости и устанавливает, для версии очтета номер версии для клиента
//	Параметры:
//		- Экземпляр				- экземпляр отчета
//		- ИдентификаторВерсии	- идентификатор версии, для которой нужно определить номер версии для клиента
//
Функция УстановитьНомерВерсииДляКлиента(Экземпляр, ИдентификаторВерсии) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НомераВерсийОтчетовДляКлиентов");
	
	ЭлементБлокировки.УстановитьЗначение("Экземпляр", Экземпляр);
	
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Экземпляр",				Экземпляр);
	Запрос.УстановитьПараметр("ИдентификаторВерсии",	ИдентификаторВерсии);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Экземпляр КАК Экземпляр,
		|	&ИдентификаторВерсии КАК ИдентификаторВерсии,
		|	ЕСТЬNULL(Текущая.НомерВерсии, ЕСТЬNULL(Максимум.НомерВерсии + 1, 1)) КАК НомерВерсии,
		|	Текущая.НомерВерсии ЕСТЬ NULL КАК Установить
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(НомераВерсийОтчетовДляКлиентов.НомерВерсии) КАК НомерВерсии
		|	ИЗ
		|		РегистрСведений.НомераВерсийОтчетовДляКлиентов КАК НомераВерсийОтчетовДляКлиентов
		|	ГДЕ
		|		НомераВерсийОтчетовДляКлиентов.Экземпляр = &Экземпляр) КАК Максимум
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НомераВерсийОтчетовДляКлиентов.НомерВерсии КАК НомерВерсии
		|		ИЗ
		|			РегистрСведений.НомераВерсийОтчетовДляКлиентов КАК НомераВерсийОтчетовДляКлиентов
		|		ГДЕ
		|			НомераВерсийОтчетовДляКлиентов.Экземпляр = &Экземпляр
		|			И НомераВерсийОтчетовДляКлиентов.ИдентификаторВерсии = &ИдентификаторВерсии) КАК Текущая
		|		ПО (ИСТИНА)";
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Если Выгрузка[0].Установить Тогда
		
		Запись = РегистрыСведений.НомераВерсийОтчетовДляКлиентов.СоздатьМенеджерЗаписи();
		
		Запись.Экземпляр			= Экземпляр;
		Запись.ИдентификаторВерсии	= ИдентификаторВерсии;
		Запись.НомерВерсии			= Выгрузка[0].НомерВерсии;
		
		Запись.Записать();
		
	КонецЕсли;
	
	Возврат Выгрузка[0].НомерВерсии;
	
КонецФункции
